using MiniSoftware;
using System;
using System.Collections.Generic;
using System.IO;

class Program
{
    static void Main()
    {
        // 1. Настройка путей
        // Важно: шаблон должен лежать рядом с exe или в папке проекта
        string templatePath = "TestTemplate.docx"; 
        string outputPath = "Result_Diploma.docx";

        // Проверка на всякий случай
        if (!File.Exists(templatePath)) 
        {
            Console.WriteLine($"❌ Ошибка: Не вижу файл {templatePath}. Проверь, что он лежит рядом с Program.cs");
            return;
        }

        Console.WriteLine("⚙️ Формируем данные...");

        var rawStudents = new[]
        {
            
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
                new { FullName = "Андрей Чикатила Сергеевич", Topic = "Підсистема «Приймальне відділення» у складі інформаційної системи міської лікарні", Teacher = "Конох І.С.", Position = "професор кафедри" },
            
        };

// ТРАНСФОРМАЦИЯ: Добавляем номер (No) каждому студенту
// Select((s, i) => ...) позволяет получить сам объект (s) и его индекс (i)
        var studentsWithNumbers = rawStudents.Select((s, i) => new 
        {
            Number = i + 1, // Генерируем номер: 0+1, 1+1...
            FullName = s.FullName,
            Topic = s.Topic,
            Teacher = s.Teacher,
            Position = s.Position
        }).ToArray(); // Важно превратить обратно в массив или список

// Собираем итоговый объект для шаблона
        
        // 2. Данные (Имитация того, что пришло из БД)
        // Обрати внимание: Plans - это список (массив) объектов.
        // MiniWord увидит список и сам продублирует строку таблицы нужное количество раз.
        var data = new
        {
            Specialty = "122 - «Комп'ютерні науки»",
            Rector = "Бутнік Дмитро",
            Director = "Олексій ЧОРНИЙ",
            ZavCaf = "Анатолій ОКСАНИЧ",
            
            // Тот самый список для таблицы
            Student = studentsWithNumbers
        };

        // 3. Генерация
        try
        {
            Console.WriteLine("🚀 Генерирую документ...");
            MiniWord.SaveAsByTemplate(outputPath, templatePath, data);
            
            Console.WriteLine($"✅ Успех! Файл создан: {Path.GetFullPath(outputPath)}");
            Console.WriteLine("Открой его и проверь таблицу.");
        }
        catch (Exception ex)
        {
            Console.WriteLine($"❌ Что-то пошло не так: {ex.Message}");
        }
    }
}